#업종명 선택

#업종별 종류 directory로 선언
indu_name = {1:["숙박업"], 2:["여행"], 3:["레저업소","레져용품"], 4:["문화.취미"], 5:["가구", "건강식품", "건축자재", "광학제품", "신변잡화", "의류", "전기제품", "주방용구", "직물"],
             6:["연료판매점"], 7:["유통업 영리", "유통업 비영리"], 8:["서적문구"], 9:["학원"], 10:["사무통신"],
             11:["자동차판매"], 12:["서비스", "수리서비스", "용역 서비스", "자동차정비 유지"], 13:["보험"], 14:["병원", "의원"], 15:["약국"],
             16:["기타의료기관"], 17:["보건위생"], 18:["음식", "음식업", "음식점업", "일반휴게음식"], 19:["음료식품"], 20:["기타", "농업", "별도관리", "회원제형태"]}


def select_industry(fr_list, indu_nm):
    find_list=[]

    #일치하는 업종명 찾기
    for i in fr_list:
        indu = i.indutype_nm.string.split('-')[0].split('/')[0] #업종명 받아오기
        for j in indu_name[indu_nm]: #사용자가 요청한 업종명과 비교
            if indu == j:
                find_list.append(i)
    return find_list
